app/controllers/posts_controller.rb

	def update
	  @post.update(params.require(:post).permit(:title, :description))
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2015-12-31 21:17:16.238910"], ["id", 3]]